package asmt0629.num3;

public class ex04 {

//     	(1) 생성자는 어떤 용도로 쓰이는가? 
//			=> 새 객체를 생성하기 위해 사용합니다.  
	
//			(2) 중복 정의된 메소드들은 어떻게 구별되어서 호출되는가?
//			=> 값을 매개변수의 자료형과 숫자에 따라 구별됩니다.

//			(3) 키워드 this는 무엇을 가리키는가?
//			=> 생성된 해당 객체를 가리킵니다. 
	
//			(4) 정적 변수와 인스턴스 변수의 차이점은 무엇인가?
//			=> 정적 변수는 프로그램 실행 시부터 종료시까지 데이터 영역에 저장공간을 가지며
//			     인스턴스 변수는 해당 객체가 생성되어있는 동안만 힙 영역에 저장공간을 가집니다.
	
//			(5) 객체가 매개 변수로 전달될 때는 어떤 값이 전달되는가?
//			 => 객체를 가리키는 주소값이 전달됩니다.
	
//			(6) 왜 정적 메소드는 인스턴스 변수를 참조할 수 없는가?
//			 => 정적 메소드는 프로그램 실행 시부터 접근이 가능한 데 반해 인스턴스 변수는 
//			      객체가 생성되어야만 접근할 수 있기 때문입니다. 
//	
}
